app/views/message/index.html.erb

    <h4><span class="glyphicon glyphicon-envelope" style="font-weight: bold;font-size: 30px;"></span> Gửi tin nhắn đến
      : <%= User.find(params[:id]).username %></h4>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]