app/views/book/index.html.erb

                <p> <%= post.content %></p>
                <p class="author"><%=User.find(post.id_author).username %></p>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

                  <%
                     postchilds = Comment.where(["id_post = ?", post.id]);
---
SELECT "comments".* FROM "comments"  WHERE (id_post = 1)
SELECT "posts".* FROM "posts"  WHERE (id_author = '1')