app/views/book/showgroup.erb

SELECT "comments".* FROM "comments"  WHERE (id_post = 7)
SELECT "posts".* FROM "posts"  WHERE (position = 'group1')  ORDER BY time desc
---
              <%
                 postchilds = Comment.where(["id_post = ?", post.id]);