app/controllers/book_controller.rb

SELECT "users".* FROM "users"
---
   def show
      #@book = Book.new;
      @title = "Hello title"
      @user = User.all;

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts"  WHERE (position = 'main7')  ORDER BY time desc
SELECT "usergroups".* FROM "usergroups"  WHERE (id_user = '1')
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
---
   def index
     if (!defined?(session[:user]) || session[:user].nil?)
       redirect_to  :controller=>"welcome",:action => "index" and return;
     end
      @position = "main"+params[:id];
      @usercurrent = User.find(session[:user]);
      @user = User.find(params[:id]);
      @posts = Post.where(["position = ?", @position]).order('time desc');
      usergroups = Usergroup.where(["id_user = ?", params[:id]]);
      a = []
      usergroups.each do |ug|
         a.push(Group.find(ug.id_group));

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "usergroups".* FROM "usergroups"  WHERE (id_user = 1)
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts"  WHERE (position = 'group1')  ORDER BY time desc
---
   def showgroup
       if (!defined?(session[:user]) || session[:user].nil?)
         redirect_to  :controller=>"welcome",:action => "index" and return;
       end
      @usercurrent = User.find(session[:user]);
      userid = session[:user];
      @user = User.find(userid);
      usergroups = Usergroup.where(["id_user = ?", userid]);
      a = []
      usergroups.each do |ug|
         a.push(Group.find(ug.id_group));
      end
      @groups = a;

      id = "group"+params[:id];
      @position = id;
      @group = Group.find(params[:id]);
      @posts = Post.where(["position = ?",id]).order('time desc');

INSERT INTO "comments" ("content", "id_author", "id_post") VALUES (?, ?, ?)  [["content", "sadeg"], ["id_author", 1], ["id_post", 1]]
---
   def postcomment
      content = params[:content];
      id_post = params[:id_post];
      userid = session[:user];
      comment = Comment.create(content: content,id_author:userid, id_post: id_post);

INSERT INTO "posts" ("content", "id_author", "position", "time") VALUES (?, ?, ?, ?)  [["content", "post moi ne"], ["id_author", 1], ["position", "group1"], ["time", "2015-05-07 23:07:22.000000"]]
---
   def postnew
     content = params[:content];
     position = params[:position];
     userid = session[:user];
     comment = Post.create(content: content,id_author:userid,position:position,time: Time.now.to_s(:db));