app/controllers/message_controller.rb

  def index
    if (!defined?(session[:user]) || session[:user].nil?)
      redirect_to  :controller=>"welcome",:action => "index" and return;
    end
    @usercurrent = User.find(session[:user]);
    @userall = User.where(["id != ?",session[:user]]);
    userid = session[:user];
    @messages = Message.where(["(id_me = ? and id_you = ?) OR (id_you = ? and id_me = ?) ", userid,params[:id],userid,params[:id]]);
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
SELECT "messages".* FROM "messages"  WHERE ((id_me = 4 and id_you = '1') OR (id_you = 4 and id_me = '1') )

  def newm
    if (!defined?(session[:user]) || session[:user].nil?)
      redirect_to  :controller=>"welcome",:action => "index" and return;
    end
    Message.create(id_me: session[:user],id_you:params[:id_you],message:params[:content]);
---
INSERT INTO "messages" ("id_me", "id_you", "message") VALUES (?, ?, ?)  [["id_me", 4], ["id_you", 1], ["message", "ngay moi nhe"]]