app/controllers/welcome_controller.rb

  def login
    if params[:username] == ''
      redirect_to :back,:flash => { :error => "Username not empty"};
      return;
    end
    if params[:password] == ''
      redirect_to :back,:flash => { :error => "Password not empty"};
      return;
    end
    @user = User.where(["username = ? and password = ?", params[:username],params[:password]]);
    if @user.count != 0
---
SELECT  "users".* FROM "users"  WHERE (username = 'tainguyen' and password = '123')  ORDER BY "users"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "users"  WHERE (username = 'sdfeg' and password = 'efegeg')

  def register
    @user = User.where(["username = ?", params[:username]]);
    if @user.count != 0
      redirect_to :back,:flash => { :error_register => "Username is exist .Please choose new username"};
      return;
    end
    arr_date = params[:birthday].split('/');
    month = arr_date.at(0);
    day = arr_date.at(1);
    year = arr_date.at(2);
    user_inser = User.create(username:params[:username],password:params[:password],age:params[:age],gender:params[:gender],birthday:year+"-"+month+"-"+day+" 00:00:00");
    #logger.debug "id vua chen la:"+User.last.id;
    session[:user] = User.last.id;
---
SELECT COUNT(*) FROM "users"  WHERE (username = 'sada')
INSERT INTO "users" ("age", "birthday", "gender", "password", "username") VALUES (?, ?, ?, ?, ?)  [["age", 12], ["birthday", "1993-10-04 11:18:15.000000"], ["gender", "0"], ["password", "fefesg"], ["username", "sada"]]
SELECT  "users".* FROM "users"   ORDER BY "users"."id" DESC LIMIT 1

  def addfriend
    Friend.create(id_me: session[:user],id_you:params[:id]);
---
INSERT INTO "friends" ("id_me", "id_you") VALUES (?, ?)  [["id_me", 3], ["id_you", 2]]

  def addgroup
    Usergroup.create(id_user: session[:user],id_group:params[:id]);
---
INSERT INTO "usergroups" ("id_group", "id_user") VALUES (?, ?)  [["id_group", 2], ["id_user", 4]]