app/views/book/part/_sidebar_recomgroup.html.erb

      <%
         @recogroup = Usergroup.where(["id_user != ?",@usercurrent.id]).select('DISTINCT id_group').limit(6);
---
SELECT  DISTINCT id_group FROM "usergroups"  WHERE (id_user != 4) LIMIT 6

          <li>
            <a href="<%=request.domain %>/group/<%= re.id_group %>" class="namegroup"><p><%= Group.find(re.id_group).name %></p></a>
---
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]