app/views/book/part/_sidebar_friend.html.erb

SELECT DISTINCT id_you, DISTINCT id_me FROM "friends"  WHERE (id_me = 3 or id_you = 3)
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
         id = @usercurrent.id;
         @id_friend = Friend.where(["id_me = ?",id]).select('DISTINCT id_you,id_me');
         @id_friend.each do |idf|
            friend = User.find(idf.id_you);

SELECT  DISTINCT id_you FROM "friends"  WHERE (id_me != 3 and id_you != 3) LIMIT 6
---
         id = @usercurrent.id;
         @id_friend = Friend.where(["id_me != ? and id_you != ?",id,id]).select('DISTINCT id_you').limit(6);

SELECT "friends".* FROM "friends"  WHERE (id_me = 3 or id_you = 3)
---
         @id_friend.each do |idf|
           @check = Friend.where(["id_me = ? and id_you = ?",id,idf.id_you]);